export const UNIT_OPTIONS = [
  { id: 1, title: '킬로그램 (kg)' },
  { id: 2, title: '밀리리터 (mL)' },
  { id: 3, title: '리터 (L)' },
  { id: 4, title: '컵 (=200mL)' },
  { id: 5, title: '테이블 스푼' },
];

export const RECIPE_FILTER_OPTIONS = [
  { id: 1, title: '최신순' },
  { id: 2, title: '인기순' },
];

export const PRICE_OPTIONS = [
  { id: 0, title: '5,000', value: '0' },
  { id: 1, title: '10,000', value: '1' },
  { id: 2, title: '50,000', value: '2' },
  { id: 3, title: '100,000', value: '3' },
  { id: 4, title: '100,000+', value: '4' },
];

export const COOK_TIME_OPTIONS = [
  { id: 0, title: '10분', value: '0' },
  { id: 1, title: '30분', value: '1' },
  { id: 2, title: '1시간', value: '2' },
  { id: 3, title: '1시간+', value: '3' },
];

export const TERMS_OPTIONS = [
  {
    id: 1,
    label: '서비스 이용약관',
    name: 'useterm',
    content: `공무원의 직무상 불법행위로 손해를 받은 국민은 법률이 정하는 바에 의하여 국가 또는
          공공단체에 정당한 배상을 청구할 수 있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
          사법권은 법관으로 구성된 법원에 속한다. 한 회계연도를 넘어 계속하여 지출할 필요가 있을
          때에는 정부는 연한을 정하여 계속비로서 국회의 의결을 얻어야 한다. 공무원의 직무상
          불법행위로 손해를 받은 국민은 법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한
          배상을 청구할 수 있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다. 사법권은 법관으로
          구성된 법원에 속한다. 한 회계연도를 넘어 계속하여 지출할 필요가 있을 때에는 정부는
          연한을 정하여 계속비로서 국회의 의결을 얻어야 한다.`,
  },
  {
    id: 2,
    label: '개인정보 수집 및 이용',
    name: 'privacy',
    content: `공무원의 직무상 불법행위로 손해를 받은 국민은 법률이 정하는 바에 의하여 국가 또는
          공공단체에 정당한 배상을 청구할 수 있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
          사법권은 법관으로 구성된 법원에 속한다. 한 회계연도를 넘어 계속하여 지출할 필요가 있을
          때에는 정부는 연한을 정하여 계속비로서 국회의 의결을 얻어야 한다. 공무원의 직무상
          불법행위로 손해를 받은 국민은 법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한
          배상을 청구할 수 있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다. 사법권은 법관으로
          구성된 법원에 속한다. 한 회계연도를 넘어 계속하여 지출할 필요가 있을 때에는 정부는
          연한을 정하여 계속비로서 국회의 의결을 얻어야 한다.`,
  },
  {
    id: 3,
    label: '마케팅 정보 수신 동의 (선택)',
    name: 'marketing',
    content: `공무원의 직무상 불법행위로 손해를 받은 국민은 법률이 정하는 바에 의하여 국가 또는
          공공단체에 정당한 배상을 청구할 수 있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
          사법권은 법관으로 구성된 법원에 속한다. 한 회계연도를 넘어 계속하여 지출할 필요가 있을
          때에는 정부는 연한을 정하여 계속비로서 국회의 의결을 얻어야 한다. 공무원의 직무상
          불법행위로 손해를 받은 국민은 법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한
          배상을 청구할 수 있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다. 사법권은 법관으로
          구성된 법원에 속한다. 한 회계연도를 넘어 계속하여 지출할 필요가 있을 때에는 정부는
          연한을 정하여 계속비로서 국회의 의결을 얻어야 한다.`,
  },
];

export const FEED_MY_OPTIONS = [
  { id: 1, title: '수정하기' },
  { id: 2, title: '삭제하기', alert: true },
];

export const FEED_OPTIONS = [
  { id: 1, title: '채팅하기' },
  { id: 2, title: '신고하기', alert: true },
];
